<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage.Master" AutoEventWireup="true" CodeBehind="ArithSeries.aspx.cs" Inherits="ProjectTaba_Vlad.ArithSeries" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
    <h2 style="text-decoration:underline; font-weight:bolder;">סדרות חשבוניות</h2>
    <p>
    מדובר בסדרות אשר בין שני איברים עוקבים יש קשר של הוספת קבוע. לדוגמא:
    .....,1,4,7,10
    <br />
    הסדרה הזו היא סדרה חשבונית, כי כל איבר בה נוצר מחיבור של 3 לאיבר הקודם.
    <br />
    וכמובן, המשפט האחרון לא נכון בכלל. למה? כי האיבר הראשון לא נוצר מהאיבר הקודם לו (שכמובן לא קיים). מה עושים?
    <br />
    אז מכאן אפשר להגדיר איבר כללי של סדרה חשבונית באופן מדויק. בשביל לדעת את האיבר הכללי של הסדרה, אנו צריכים כאמור את ההפרש הקבוע בין שני האיברים, נסמנו d, (אם הוא לא קובע אנחנו עובדים לחינם, הסדרה לא חשבונית) וכן את האיבר הראשון, נסמנו a1. מכאן אפשר לרשום נוסחא לאיבר הכללי של סדרה חשבונית:
    <img src="pics/series8.png"  class="inlineimg"/>.
    כאשר d>0 הסדרה עולה, כלומר כל איבר גדול מקודמו, וכאן d<0 הסדרה יורדת, כלומר כל איבר קטן מקודמו.
    <br />
    אם ניקח את הסדרה בדוגמא הקודמת, נקבל על ידי הצבה כי הכלל הוא 3n-1.
     <br />
    דבר נוסף שנרצה למצוא כשנדבר על סדרות חשבוניות הוא סכום של סדרה חשבונית. נניח כי יש לנו את הסדרה 99,...,1,3,5,7, ונרצה לדעת מה יקרה אם נחבר את כל איבריה. במקום לשבת שעות ולשבור את הראש, חברינו המתמטיקאים מביאים לנו את הנוסחא הבא:
    <img src="pics/series9.gif" />
    כאשר Sn הוא הסכום של n האיברים הראשונים, d  הוא הפרש הסדרה, a1 הוא האיבר הראשון, n הוא מספר המחוברים. השוויון השני נובע מהצבה של האיבר הכללי, כמו שמוסבר לעיל. השוויון השלישי הוא פשוט חשבון של כיתה א'. 
    כדי להוכיח שסדרה היא חשבונית, כאשר נתון לנו כלל שלה, נפעל כך: ניקח את האיבר הכללי, ועליו נציב n+1 במקום n. מכאן נקבל את an+1. כעת, נחסר an+1-an. אם קיבלנו מספר קבוע (או לחלופין פרמטר קבוע ולא משתנה, וכמו כן שילוב בין מספרים ופרמטרים), הסדרה חשבונית. אם קיבלנו תשובה שתלויה ב-n, הסדרה לא חשבונית.
    הסבר לשיטה: מה שבעצם עשינו הוא פשוט מאד, לקחנו שני איברים כללי, ומצאנו את ההפרש ביניהם. אם ההפרש קבוע, הסדרה חשבונית. היות ולא דברנו על איברים קבועים כלשהם, או לא הגבלנו את האיבר, הרי שהדבר שהוכחנו תקף לכל זוג איברים עוקבים בסדרה, ולכן ממש לפי ההגדרה הסדרה חשבונית.
    לדוגמא: אם נתונה הסדרה 
    <img src="pics/series10.png" class="inlineimg"/>
    , ואנו רוצים לגלות האם היא חשבונית. נרשום:
    <img src="pics/series11.png" />
    1 הוא קבוע, ולכן הסדרה חשבונית. באופן כללי יותר, כל משוואה לינארית מן הצורה cn+b, כאשר n רץ מ 1 והלאה, וc,b הם פרמטרים. תרגיל נחמד בנושא זה הוא למצוא את ההפרש והאיבר הראשון של הסדרה הכללית.
    דוגמאות לסדרה לא חשבונית - 2^n (הוכיחו!), ובאופן כללי כל סדרה בה קיים n מחזקה גדולה מ1. דוגמא נוספת היא 1 חלקי n, וכו' וכו'.
    אבל מה קורה אם נתונה לנו רק הנוסחא לסכום. כלומר, אנחנו יודעים שקיימת סדרה כלשהי והסכום שלה מתואר בעזרת נוסחא מסוימת (כרגע לצורכי נוחיות הסדרה היא חשבונית). איך נמצא את האיבר הכללי? אז כפי שגילו, וגם דיי קל להוכיח, מתקיים: 
    <img src="pics/series12.gif" style="height:20px; width:auto;"/>
    אם נציב בנוסחאת הסכום n-1, ונחסר בין שני הנוסחאות, נקבל בדיוק את הנוסחא לאיבר הכללי.
    </p>
    <a href="series.aspx">בחזרה לדף של הסדרות</a>
</asp:Content>
