<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage.Master" AutoEventWireup="true" CodeBehind="GeoSeries.aspx.cs" Inherits="ProjectTaba_Vlad.WebForm3" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
     <h2 style="text-decoration:underline; font-weight:bolder;">סדרות הנדסיות</h2>
    <p>
     סוג שני של סדרות הוא סדרה הנדסית. בניגוד לסדרה חשבונית, בה הכלל היה בעזרת הוספת מספר, כאן הכלל הוא הכפלת כל איבר בקבוע. כלומר, כל איבר הוא כפולה של קודמו, ושוב זו טעות, אז נאמר חוץ מהאיבר הראשון, שהוא צריך להיות נתון (בצורה זו או אחרת). הגדרה אחרת היא, שמנת כל שני איברים סמוכים היא קבועה, ומנה זו מסומנת בq. הכלל במקרה זה הוא:
     <img src="pics/series13.png" class="inlineimg"/>
     <br />
     לדוגמא, הסדרה ההנדסית שאיברה הראשון הוא 12, ומנתה היא 12, הכלל יהיה: 
     <img src="pics/series14.png" class="inlineimg"/>.
     כאשר המנה q היא גדולה מ-1, בוודאי שהסדרה תעלה, וכל איבר יהיה גדול מקודמו (שוב בלי האיבר הראשון). אם q=1, הסדרה קבועה, ולבסוף אם q<1 וגם q>0 הסדרה יורדת, וכל איבר בה קטן מקודמו(על המטרה בו q<0 לא נדבר פה).
     במקרה זה, הסכום של n איברים ראשונים של סדרה הנדסית מוגדר על ידי הנוסחא:
     <img src="pics/series15.png" style="height:40px; width:auto;" />
     כדי להוכיח שסדרה מסוימת היא סדרה הנדסית, התהליך יהיה כמעט זהה לזה שמוצג בהסבר תחת סדרה חשבונית. במקום לחסר, נחלק, כלומר יש לקחת את הנוסחא של הסדרה, להציב בה n+1, לחלק בנוסחא הקודמת, ואם קיבלנו מספר קבוע (שוב, בכל השילובים האפשריים לפרמטרים). זוהי מנת הסדרה, והסדרה חשבונית.
     גם כאן ניתן למצוא, בדיוק לפי אותו הסבר כמו בסדרה חשבונית, איבר כללי לפי נוסחאת הסכום, על פי הכלל   
     <img src="pics/series16.gif" class="inlineimg"/>
     <br />
    </p>
    <h2 style="text-decoration:underline; font-weight:bolder;">סדרות הנדסיות אינסופיות</h2>
    מקרה מיוחד של סדרה הנדסית הוא כאשר לסדרה האינסופית אין מספר מסוים של איברים, אבל היא בכל מקרה הנדסית ואפשר לדבר על כמה דברים מעניינים שקשורים אליה. הנוסחא לסדרה היא אותה נוסחא כמו של סדרה הנדסית, אבל חייב להתקיים תנאי חשוב : q<1 וגם q>-1. כלומר, q הוא למעשה שבר בין 0 ל-1. לכן, ככל שנתקדם לאורך איברי הסדרה, האיברים יקטנו. אבל אמרנו שהסדרה היא אינסופית. אם נתבונן בנוסחא לסכום, יש בה את הביטוי qn מופיע. נבחן את הביטוי - אם q הוא שבר, ו-n הוא "אינסוף" (מה זה אינסוף?) אנו כביכול מכפילים שבר בין 0 ל-1 בעצמו "הרבה מאד פעמים". לכן בסופו של דבר, נקבל 0. אם אתם לא מאמינים לי, נסו לכתוב חצי במחשבון, והכפילו אותו בעצמו (ואם אתם עצלנים, העלו בחזקה גבוהה), ולאט לאט תראו שהתוצאה מתקרב לאפס.
    חשוב לי לציין כי זהו הסבר אינטואיטיבי מאד, ומתמטית הוא מאד לא מדויק. ובכל מקרה, זוהי דרך להבין את הדברים כפי שהוצגו. לבסוף, נציב במקום q^n את אפס, ובסה"כ נקבל כי הסכום של סדרה הנדסית הוא:
    <img src="pics/series17.png" class="inlineimg"/>
    <br />
    כמובן שלא נרשום כאן S עם n לצידו, כי אי אפשר להציב פה ערכים שונים של n, והסכום לא תלוי ב-n.  
    </p>
    <a href="series.aspx">בחזרה לדף של הסדרות</a>
    <table>
        
    </table>
</asp:Content>
